PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_canfd.h
/***************************************
*        Function Prototypes
***************************************/

/**
* \addtogroup group_canfd_functions
* \{
*/
__STATIC_INLINE void Cy_CANFD_Enable(CANFD_Type *base, uint32_t channelMask);
__STATIC_INLINE cy_en_canfd_status_t Cy_CANFD_Disable(CANFD_Type *base, uint32_t channelMask);
__STATIC_INLINE void Cy_CANFD_EnableMRAM(CANFD_Type *base, uint32_t channelMask, uint16_t delay);
__STATIC_INLINE cy_en_canfd_status_t Cy_CANFD_DisableMRAM(CANFD_Type *base);
__STATIC_INLINE void Cy_CANFD_SetBitrate(CANFD_Type *base, uint32_t chan, const cy_stc_canfd_bitrate_t *bitrate);
__STATIC_INLINE void Cy_CANFD_SetFastBitrate(CANFD_Type *base, uint32_t chan, const cy_stc_canfd_bitrate_t *fastBitrate);
void Cy_CANFD_SidFilterSetup(CANFD_Type const *base, uint32_t chan,
                             const cy_stc_id_filter_t *filter,
                             uint32_t index,
                             cy_stc_canfd_context_t const *context);
void Cy_CANFD_SidFiltersSetup(CANFD_Type const *base, uint32_t chan,
                              const cy_stc_canfd_sid_filter_config_t *filterConfig,
                              cy_stc_canfd_context_t const *context);
void Cy_CANFD_XidFilterSetup(CANFD_Type const *base, uint32_t chan,
                             const cy_stc_extid_filter_t *filter,
                             uint32_t index,
                             cy_stc_canfd_context_t const *context);

void Cy_CANFD_XidFiltersSetup(CANFD_Type const *base, uint32_t chan,
                              const cy_stc_canfd_extid_filter_config_t *filterConfig,
                              cy_stc_canfd_context_t const *context);
cy_en_canfd_status_t Cy_CANFD_TxBufferConfig(CANFD_Type const *base, uint32_t chan,
        const cy_stc_canfd_tx_buffer_t *txBuffer,
        uint8_t index,
        cy_stc_canfd_context_t const *context);
uint32_t Cy_CANFD_CalcRxBufAdrs(CANFD_Type const *base, uint32_t chan,
                                uint32_t index,
                                cy_stc_canfd_context_t const *context);
uint32_t Cy_CANFD_CalcRxFifoAdrs(CANFD_Type const *base, uint32_t chan,
                                 uint32_t fifoNumber,
                                 uint32_t index,
                                 cy_stc_canfd_context_t const *context);
cy_en_canfd_status_t Cy_CANFD_GetRxBuffer(CANFD_Type const *base, uint32_t chan,
        const uint32_t bufferAddress,
        cy_stc_canfd_rx_buffer_t const *rxBuffer);
cy_en_canfd_status_t Cy_CANFD_GetFIFOTop(CANFD_Type const *base, uint32_t chan,
        const uint8_t FIFONumber,
        cy_stc_canfd_rx_buffer_t const *rxBuffer);
cy_en_canfd_status_t Cy_CANFD_ExtractMsgFromRXBuffer(CANFD_Type *base, uint32_t chan, bool rxFIFOMsg,
        uint8_t msgBufOrRxFIFONum,
        cy_stc_canfd_rx_buffer_t const *rxBuffer,
        cy_stc_canfd_context_t const *context);
void Cy_CANFD_AckRxBuf(CANFD_Type *base, uint32_t chan, uint32_t bufNum);
void Cy_CANFD_AckRxFifo(CANFD_Type *base, uint32_t chan, uint32_t FIFOnumber);
__STATIC_INLINE cy_en_canfd_status_t Cy_CANFD_ConfigChangesEnable(CANFD_Type *base, uint32_t chan);
__STATIC_INLINE cy_en_canfd_status_t Cy_CANFD_ConfigChangesDisable(CANFD_Type *base, uint32_t chan);
__STATIC_INLINE void Cy_CANFD_TestModeConfig(CANFD_Type *base, uint32_t chan, cy_stc_canfd_test_mode_t testMode);
__STATIC_INLINE void Cy_CANFD_SetTDC(CANFD_Type *base, uint32_t chan,
                                     const cy_stc_canfd_transceiver_delay_compensation_t *tdcConfig);
uint32_t Cy_CANFD_GetLastError(CANFD_Type const *base, uint32_t chan);

/** \} group_canfd_functions */

/**
* \addtogroup group_canfd_functions
* \{
*/

void Cy_CANFD_IrqHandler(CANFD_Type *base, uint32_t chan, cy_stc_canfd_context_t const *context);
cy_en_canfd_status_t Cy_CANFD_Init(CANFD_Type *base, uint32_t chan,
                                   const cy_stc_canfd_config_t *config,
                                   cy_stc_canfd_context_t *context);
cy_en_canfd_status_t Cy_CANFD_DeInit(CANFD_Type *base, uint32_t chan, cy_stc_canfd_context_t *context);
cy_en_canfd_status_t Cy_CANFD_TransmitTxBuffer(CANFD_Type *base, uint32_t chan,
        uint8_t index);
cy_en_canfd_status_t Cy_CANFD_UpdateAndTransmitMsgBuffer(CANFD_Type *base, uint32_t chan,
        const cy_stc_canfd_tx_buffer_t *txBuffer,
        uint8_t index,
        cy_stc_canfd_context_t const *context);

cy_en_canfd_tx_buffer_status_t Cy_CANFD_GetTxBufferStatus(CANFD_Type const *base, uint32_t chan, uint8_t index);


/** \} group_canfd_functions */

/**
* \addtogroup group_canfd_functions
* \{
*/

__STATIC_INLINE uint32_t Cy_CANFD_GetInterruptStatus(CANFD_Type const *base, uint32_t chan);
__STATIC_INLINE void Cy_CANFD_ClearInterrupt(CANFD_Type *base, uint32_t chan, uint32_t status);
__STATIC_INLINE uint32_t Cy_CANFD_GetInterruptMask(CANFD_Type const *base, uint32_t chan);
__STATIC_INLINE void Cy_CANFD_SetInterruptMask(CANFD_Type *base, uint32_t chan, uint32_t interrupt);
__STATIC_INLINE uint32_t Cy_CANFD_GetInterruptLine(CANFD_Type const *base, uint32_t chan);
__STATIC_INLINE void Cy_CANFD_SetInterruptLine(CANFD_Type *base, uint32_t chan, uint32_t interruptLineMask);
__STATIC_INLINE bool Cy_CANFD_IsInterruptLineEnabled(CANFD_Type const *base, uint32_t chan,
        uint32_t interruptLineMask);
__STATIC_INLINE void Cy_CANFD_EnableInterruptLine(CANFD_Type *base, uint32_t chan, uint32_t interruptLineMask);

/** \} group_canfd_functions */

/**
* \addtogroup group_canfd_functions
* \{
*/

/*******************************************************************************
* Function Name: Cy_CANFD_Enable
****************************************************************************//**
*
*  Enables the CAN FD channels.
*
* \note
* Call Cy_CANFD_Enable before Cy_CANFD_Init.
*
* \param *base
* The CAN FD registers structure pointer.
*
* \param channelMask
* The channel mask (0-0xFF).
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_Enable
*
*******************************************************************************/
__STATIC_INLINE void Cy_CANFD_Enable(CANFD_Type *base, uint32_t channelMask)
{
    CY_ASSERT_L2(CY_CANFD_IS_CHS_MASK_VALID(channelMask));

