PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_canfd.h
    /* Clock Start Request for the channels */
    CANFD_CTL(base) = _CLR_SET_FLD32U(CANFD_CTL(base),
                                      CANFD_CTL_STOP_REQ,
                                      ~channelMask);
}


/*******************************************************************************
* Function Name: Cy_CANFD_Disable
****************************************************************************//**
*
* Disables the CAN FD channels to stop providing clocks to un-used CAN channels
* for power saving with this functionality.
*
* \note
* Call Cy_CANFD_Disable only after Cy_CANFD_DeInit. Do not access the CAN FD
* registers until calling Cy_CANFD_Enable again.
*
* \param *base
*  The CAN FD registers structure pointer.
*
* \param channelMask
*     The channel mask (0-0xFF).
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_Disable
*
*******************************************************************************/
__STATIC_INLINE cy_en_canfd_status_t Cy_CANFD_Disable(CANFD_Type *base, uint32_t channelMask)
{
    cy_en_canfd_status_t ret = CY_CANFD_ERROR_TIMEOUT;
    uint32_t                retry = CY_CANFD_RETRY_COUNT;

    CY_ASSERT_L2(CY_CANFD_IS_CHS_MASK_VALID(channelMask));

    /* Clock Stop Request for the channels */
    CANFD_CTL(base) = _CLR_SET_FLD32U(CANFD_CTL(base),
                                      CANFD_CTL_STOP_REQ,
                                      channelMask);

    /* Wait for Clock Stop Acknowledge for the channel */
    while ((retry > 0UL) &&
            !(channelMask == (channelMask & CANFD_STATUS(base))))
    {
        Cy_SysLib_DelayUs(CY_CANFD_STOP_TIMEOUT_US);
        retry--;
    }

    if (retry > 0UL)
    {
        ret = CY_CANFD_SUCCESS;
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_CANFD_EnableMRAM
****************************************************************************//**
*
*  Switches MRAM on and enables the channels.
*
* \param *base
*     The CAN FD registers structure pointer.
*
* \param channelMask
*     The channel mask (0-0xFF).
*
* \param delay
*     The delay in usec to wait power up time before MRAM can be used.
*     Recommended value is 150 CPU cycles or 6 usec for the 25 MHz CPU clock.
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_EnableMRAM
*
*******************************************************************************/
__STATIC_INLINE void Cy_CANFD_EnableMRAM(CANFD_Type *base, uint32_t channelMask, uint16_t delay)
{
    CY_ASSERT_L2(CY_CANFD_IS_CHS_MASK_VALID(channelMask));

    /* MRAM power on */
    CANFD_CTL(base) = _CLR_SET_FLD32U(CANFD_CTL(base), CANFD_CTL_MRAM_OFF, 0UL);

    /* Wait a certain power up time before MRAM can be used,
     * i.e. before STOP_REQ can be de-asserted (before Clock Stop reset)
     */
    Cy_SysLib_DelayUs(delay);

    /* Reset the Clock Stop request */
    Cy_CANFD_Enable(base, channelMask);
}


/*******************************************************************************
* Function Name: Cy_CANFD_DisableMRAM
****************************************************************************//**
*
*  Disables the channels and switches MRAM off.
*
* \param *base
*     The CAN FD registers structure pointer.
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_DisableMRAM
*
*******************************************************************************/
__STATIC_INLINE cy_en_canfd_status_t Cy_CANFD_DisableMRAM(CANFD_Type *base)
{
    cy_en_canfd_status_t ret = CY_CANFD_ERROR_TIMEOUT;

    /* Request Clock Stop for all channels */
    ret = Cy_CANFD_Disable(base, ((1UL << CY_CANFD_CHANNELS_NUM) - 1UL));

    /* MRAM power down */
    CANFD_CTL(base) = _CLR_SET_FLD32U(CANFD_CTL(base),
                                      CANFD_CTL_MRAM_OFF,
                                      1UL);

    return ret;
}


/*******************************************************************************
* Function Name: Cy_CANFD_SetBitrate
****************************************************************************//**
*
*  Sets Nominal Bit Timing and Prescaler Register parameters:
*  -Nominal Time segment after sample point;
*  -Nominal Time segment before sample point;
*  -Nominal Baud Rate Prescaler;
*  -Nominal Synchronization Jump Width.
*
* \note Before calling the Cy_CANFD_SetBitrate() function,
*  the Cy_CANFD_ConfigChangesEnable() function must be called to set
*  bits CCCR.CCE and CCCR.INIT. It is recommended to call
*  Cy_CANFD_ConfigChangesDisable() after updating Bitrate.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
* The CAN FD channel number.
*
* \param *bitrate \ref cy_stc_canfd_bitrate_t
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_SetBitrate
*
*******************************************************************************/
__STATIC_INLINE void Cy_CANFD_SetBitrate(CANFD_Type *base, uint32_t chan, const cy_stc_canfd_bitrate_t *bitrate)
{
    if (NULL != bitrate)
    {
        CY_ASSERT_L2(CY_CANFD_IS_NOM_PRESCALER_VALID(bitrate->prescaler));
        CY_ASSERT_L2(CY_CANFD_IS_NOM_TIME_SEG_1_VALID(bitrate->timeSegment1));
        CY_ASSERT_L2(CY_CANFD_IS_NOM_TIME_SEG_2_VALID(bitrate->timeSegment2));
        CY_ASSERT_L2(CY_CANFD_IS_NOM_SYNC_JUMP_WIDTH_VALID(bitrate->syncJumpWidth));

        CANFD_NBTP(base, chan) = _VAL2FLD(CANFD_CH_M_TTCAN_NBTP_NTSEG2, bitrate->timeSegment2) |
                                 _VAL2FLD(CANFD_CH_M_TTCAN_NBTP_NTSEG1, bitrate->timeSegment1) |
                                 _VAL2FLD(CANFD_CH_M_TTCAN_NBTP_NBRP, bitrate->prescaler)      |
                                 _VAL2FLD(CANFD_CH_M_TTCAN_NBTP_NSJW, bitrate->syncJumpWidth);
    }
}


/*******************************************************************************
* Function Name: Cy_CANFD_SetFastBitrate
****************************************************************************//**
*
*  Sets Data Bit Timing and Prescaler Register parameters for data:
*  -Data Time segment after sample point;
*  -Data Time segment before sample point;
*  -Data Baud Rate Prescaler;
*  -Data Synchronization Jump Width.
*
* \note Before calling the Cy_CANFD_SetFastBitrate() function,
*  the Cy_CANFD_ConfigChangesEnable() function must be called to set
*  bits CCCR.CCE and CCCR.INIT. It is recommended to call
*  Cy_CANFD_ConfigChangesDisable() after updating Bitrate.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
*     The CAN FD channel number.
*
* \param *fastBitrate \ref cy_stc_canfd_bitrate_t
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_SetFastBitrate
*
*******************************************************************************/
__STATIC_INLINE void Cy_CANFD_SetFastBitrate(CANFD_Type *base, uint32_t chan, const cy_stc_canfd_bitrate_t *fastBitrate)
{
    uint32_t regValue;

    if (NULL != fastBitrate)
    {
        CY_ASSERT_L2(CY_CANFD_IS_DAT_PRESCALER_VALID(fastBitrate->prescaler));
        CY_ASSERT_L2(CY_CANFD_IS_DAT_TIME_SEG_1_VALID(fastBitrate->timeSegment1));
        CY_ASSERT_L2(CY_CANFD_IS_DAT_TIME_SEG_2_VALID(fastBitrate->timeSegment2));
        CY_ASSERT_L2(CY_CANFD_IS_DAT_SYNC_JUMP_WIDTH_VALID(fastBitrate->syncJumpWidth));

