PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_canfd.h
        regValue = CANFD_DBTP(base, chan);  /* Get Data Bit Timing and Prescaler Register */

        regValue &= ~(CANFD_CH_M_TTCAN_DBTP_DTSEG2_Msk |
                      CANFD_CH_M_TTCAN_DBTP_DTSEG1_Msk |
                      CANFD_CH_M_TTCAN_DBTP_DBRP_Msk   |
                      CANFD_CH_M_TTCAN_DBTP_DSJW_Msk);

        regValue |= _VAL2FLD(CANFD_CH_M_TTCAN_DBTP_DTSEG2, fastBitrate->timeSegment2) |
                    _VAL2FLD(CANFD_CH_M_TTCAN_DBTP_DTSEG1, fastBitrate->timeSegment1) |
                    _VAL2FLD(CANFD_CH_M_TTCAN_DBTP_DBRP, fastBitrate->prescaler)      |
                    _VAL2FLD(CANFD_CH_M_TTCAN_DBTP_DSJW, fastBitrate->syncJumpWidth);

        CANFD_DBTP(base, chan) = regValue; /* Set Data Bit Timing and Prescaler Register */
    }
}


/*******************************************************************************
* Function Name: Cy_CANFD_ConfigChangesEnable
****************************************************************************//**
*
*  Enables the CPU write access to the protected configuration registers
*  of the CAN FD block and sets the CAN FD block into the initialization
*  state.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
* The CAN FD channel number.
*
* \return
* \ref cy_en_canfd_status_t
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_ConfigChangesEnable
*
*******************************************************************************/
__STATIC_INLINE cy_en_canfd_status_t Cy_CANFD_ConfigChangesEnable(CANFD_Type *base, uint32_t chan)
{
    cy_en_canfd_status_t ret = CY_CANFD_BAD_PARAM;
    uint32_t  retry = CY_CANFD_RETRY_COUNT;

    /* Set CCCR_INIT and wait until it is settled */
    CANFD_CCCR(base, chan) = CANFD_CH_M_TTCAN_CCCR_INIT_Msk;

    while ((retry > 0UL) && !_FLD2BOOL(CANFD_CH_M_TTCAN_CCCR_INIT, CANFD_CCCR(base, chan)))
    {
        Cy_SysLib_DelayUs(CY_CANFD_INIT_TIMEOUT_US);
        retry--;
    }

    if (retry > 0UL)
    {
        /* Enable configuration changes by setting the CCE bit */
        CANFD_CCCR(base, chan) |= CANFD_CH_M_TTCAN_CCCR_CCE_Msk;

        ret = CY_CANFD_SUCCESS;
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_CANFD_ConfigChangesDisable
****************************************************************************//**
*
*  Disables the CPU write access to the protected configuration registers
*  of the CAN FD block and sets the CAN FD block into the Normal Operation.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
*     The CAN FD channel number.
*
* \return
* \ref cy_en_canfd_status_t
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_ConfigChangesDisable
*
*******************************************************************************/
__STATIC_INLINE cy_en_canfd_status_t Cy_CANFD_ConfigChangesDisable(CANFD_Type *base, uint32_t chan)
{
    cy_en_canfd_status_t ret = CY_CANFD_BAD_PARAM;
    uint32_t  retry = CY_CANFD_RETRY_COUNT;

    /* Clear CCCR_INIT bit and wait until it is updated to finalize CAN FD initialization */
    CANFD_CCCR(base, chan) &= (uint32_t) ~CANFD_CH_M_TTCAN_CCCR_INIT_Msk;

    while ((retry > 0UL) && _FLD2BOOL(CANFD_CH_M_TTCAN_CCCR_INIT, CANFD_CCCR(base, chan)))
    {
        Cy_SysLib_DelayUs(CY_CANFD_INIT_TIMEOUT_US);
        retry--;
    }

    if (retry > 0UL)
    {
        ret = CY_CANFD_SUCCESS;
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_CANFD_TestModeConfig
****************************************************************************//**
*
*  Configures test mode.
*
* \note The \ref Cy_CANFD_ConfigChangesEnable must be called before calling
*  this function to enable the configuration changes.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
*     The CAN FD channel number.
*
* \param testMode \ref cy_stc_canfd_test_mode_t
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_TestModeConfig
*
*******************************************************************************/
__STATIC_INLINE void Cy_CANFD_TestModeConfig(CANFD_Type *base, uint32_t chan, cy_stc_canfd_test_mode_t testMode)
{
    switch (testMode)
    {
    case CY_CANFD_TEST_MODE_DISABLE:
        CANFD_CCCR(base, chan) &= (uint32_t) ~(CANFD_CH_M_TTCAN_CCCR_TEST_Msk | /* Disable Test Mode */
                                               CANFD_CH_M_TTCAN_CCCR_MON__Msk);  /* Disable Bus Monitoring Mode */
        CANFD_TEST(base, chan) &= (uint32_t) ~CANFD_CH_M_TTCAN_TEST_LBCK_Msk;   /* Disable Loop Back Mode */
        break;
    case CY_CANFD_TEST_MODE_BUS_MONITORING:
        CANFD_CCCR(base, chan) |= (CANFD_CH_M_TTCAN_CCCR_MON__Msk);  /* Enable Bus Monitoring Mode */
        break;
    case CY_CANFD_TEST_MODE_EXTERNAL_LOOP_BACK:
        CANFD_CCCR(base, chan) |= CANFD_CH_M_TTCAN_CCCR_TEST_Msk;  /* Enable Test Mode */
        CANFD_TEST(base, chan) |= CANFD_CH_M_TTCAN_TEST_LBCK_Msk;  /* Enable Loop Back Mode */
        break;
    case CY_CANFD_TEST_MODE_INTERNAL_LOOP_BACK:
        CANFD_CCCR(base, chan) |= (CANFD_CH_M_TTCAN_CCCR_TEST_Msk |  /* Enable Test Mode */
                                   CANFD_CH_M_TTCAN_CCCR_MON__Msk);  /* Enable Bus Monitoring Mode */
        CANFD_TEST(base, chan) |= CANFD_CH_M_TTCAN_TEST_LBCK_Msk;  /* Enable Loop Back Mode */
        break;
    default:
        /* Unsupported test mode */
        break;
    }
}


/*******************************************************************************
* Function Name: Cy_CANFD_SetTDC
****************************************************************************//**
*
* Sets the CAN FD transceiver delay compensation offset.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
*  The CAN FD channel number.
*
* \param *tdcConfig
*  The CAN FD transceiver delay compensation offset configuration.
*
*******************************************************************************/
__STATIC_INLINE void Cy_CANFD_SetTDC(CANFD_Type *base, uint32_t chan,
                                     const  cy_stc_canfd_transceiver_delay_compensation_t *tdcConfig)
{
    if (NULL != tdcConfig)
    {
        CY_ASSERT_L2(CY_CANFD_IS_TDCO_VALID(tdcConfig->tdcOffset));
        CY_ASSERT_L2(CY_CANFD_IS_TDCF_VALID(tdcConfig->tdcFilterWindow));

        /* Transceiver Delay Compensation is enabled or disabled */
        CANFD_DBTP(base, chan) = _CLR_SET_FLD32U(CANFD_DBTP(base, chan),
                                 CANFD_CH_M_TTCAN_DBTP_TDC,
                                 ((tdcConfig->tdcEnabled) ? 1UL : 0UL));

        /* Transmitter Delay Compensation Offset and Filter Window Length */
        CANFD_TDCR(base, chan) = _VAL2FLD(CANFD_CH_M_TTCAN_TDCR_TDCO, tdcConfig->tdcOffset) |
                                 _VAL2FLD(CANFD_CH_M_TTCAN_TDCR_TDCF, tdcConfig->tdcFilterWindow);
    }
}

